
# Options
cask_args appdir: '~/Applications', require_sha: true

# Taps
tap "blacktop/tap"
tap "espanso/espanso"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "peripheryapp/periphery"
tap "robotsandpencils/made"

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew 'git'          # Version controll
brew 'neovim'       # Text editor
brew 'ranger'       # Directory browser
brew 'tmux'         # Term multiplexer

# CLI Basics
brew 'aria2'        # Resuming download util (better wget)
brew 'bat'          # Output highlighting (better cat)
brew 'broot'        # Interactive directory navigation
brew 'ctags'        # Indexing of file info + headers
brew 'diff-so-fancy'# Readable file compares (better diff)
brew 'duf'          # Get info on mounted disks (better df)
brew 'entr'         # Run command whenever file changes
brew 'exa'          # Listing files with info (better ls)
brew 'exiftool'     # Read, write and modify exif data
brew 'fzf'          # Fuzzy file finder and filtering
brew 'hyperfine'    # Benchmarking for arbitrary commands
brew 'jdupes'       # Duplicate file finder
brew 'just'         # Powerful command runner (better make)
brew 'jq'           # JSON parser, output and query files
brew 'most'         # Multi-window scroll pager (better less)
brew 'procs'        # Advanced process viewer (better ps)
brew 'ripgrep'      # Searching within files (better grep)
brew 'rsync'        # Fast incremental file transfer
brew 'sd'           # RegEx find and replace (better sed)
brew 'thefuck'      # Auto-correct miss-typed commands
brew 'tldr'         # Community-maintained docs (better man)
brew 'tokei'        # Count lines of code (better cloc)
brew 'tree'         # Directory listings as tree structure
brew 'trash-cli'    # Record and restore removed files
brew 'watch'        # Run commands periorically
brew 'xsel'         # Copy paste access to the X clipboard
brew 'zoxide'       # Auto-learning navigation (better cd)

# CLI Monitoring and Performance Apps
brew 'bmon'         # Bandwidth utilization monitor 
brew 'ctop'         # Container metrics and monitoring
brew 'dog'          # DNS lookup client (better dig)
brew 'bpytop'       # Resource monitoring (like htop)
brew 'dua-cli'      # Disk usage analyzer and monitor (better du)
brew 'glances'      # Resource monitor + web and API
brew 'goaccess'     # Web log analyzer and viewer
brew 'gping'        # Interactive ping tool, with graph
brew 'speedtest-cli'# Command line speed test utility

# CLI Development Suits
brew 'httpie'       # HTTP / API testing testing client
brew 'lazydocker'   # Full Docker management app
brew 'lazygit'      # Full Git management app
brew 'kdash'        # Kubernetes management

# CLI External Sercvices
cask 'ngrok'        # Reverse proxy for sharing localhost
brew 'tmate'        # Share a terminal session via internet
brew 'asciinema'    # Recording + sharing terminal sessions
brew 'navi'         # Browse, search, read cheat sheets

# CLI Fun
brew 'cowsay'       # Have an ASCII cow say your message
brew 'figlet'       # Output text as big ASCII art text
brew 'lolcat'       # Make console output rainbow colored
brew 'neofetch'     # Show system data and ditstro info
brew 'pipes-sh'     # Cool terminal pipe screen saver
brew 'pv'           # Pipe viewer, with animation options

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
cask 'boop'           		# Text transformation tool
cask 'iterm2'         		# Better terminal emulator
cask 'postman'        		# HTTP API testing app
cask 'sourcetree'     		# Git visual client
cask 'visual-studio-code' 	# Code editor
cask 'diffmerge'			# Visually compare and merge files
cask 'githubpulse'			# Statusbar app to help you remember to contribute every day on Github
cask 'gitkraken-cli'		# CLI for GitKraken
cask 'firebase-admin'		# https://firebaseadmin.com/
cask 'github'				# Desktop client for GitHub repositories
cask 'macdown'				# Open-source Markdown editor | https://macdown.uranusjr.com/

# iOS Development
brew 'mint'			  		# Swift CLI dependencies manager
brew "carthage"     		# Xcode dependencies management
brew "copilot"				# Github copilot
cask 'copilot-for-xcode'	# Xcode extension for Github Copilot
cask 'devcleaner'			# Reclaim tens of gigabytes of your storage used for various Xcode cache
cask 'firebase-admin'		# https://firebaseadmin.com/
cask 'github'				# Desktop client for GitHub repositories
cask 'xcodes'     			# Install and switch between multiple versions of Xcode | https://github.com/RobotsAndPencils/XcodesApp
cask "mockoon"				# Design and run mock REST APIs
cask "periphery"
cask 'wwdc'					# Allows access to WWDC livestreams, videos and sessions | https://wwdc.io/	
cask 'swiftformat-for-xcode'	# Xcode Extension for reformatting Swift code | https://github.com/nicklockwood/SwiftFormat
cask 'simsim'				# Tool to explore iOS application folders in Terminal or Finder | https://github.com/dsmelov/simsim/
cask 'sf-symbols'			# Tool that provides consistent, highly configurable symbols for apps
cask 'rapidapi'				# HTTP client that helps testing and describing APIs | https://paw.cloud/
cask 'proxyman'				# HTTP debugging proxy | https://proxyman.io/

#### Paid 
#cask 'reveal'				# Powerful runtime view debugging for iOS developers | https://revealapp.com/


# Blockchain Development 
cask 'ganache'				# Personal blockchain for Ethereum development
cask 'remix-ide'			# Desktop version of Remix web IDE used for Ethereum smart contract development | https://remix-project.org/

# Development Langs, Compilers, Package Managers and SDKs
brew 'node'           # Node.js
brew 'nvm'            # Switching node versions
brew 'openjdk'        # Java development kit
brew 'python'         # Python interpreter

# Other Dev Tools 
cask 'react-studio'			# App design environment | https://reactstudio.com/
cask 'react-native-debugger' 	# Standalone app for debugging React Native apps | https://github.com/jhen0409/react-native-debugger

# Development Utils
brew 'gh'             		# Interact with GitHub PRs, issues, repos
brew 'git-extras'     		# Extra git commands for common tasks
brew 'scrcpy'         		# Display and control Android devices
brew 'terminal-notifier' 	# Trigger Mac notifications from terminal
brew 'tig'            		# Text-mode interface for git
cask 'open-in-code'			# Finder toolbar app to open current folder in Visual Studio Code | https://github.com/sozercan/OpenInCode
cask 'obsidian'				# Knowledge base that works on top of a local folder of plain text Markdown files | https://obsidian.md/
cask 'nslogger'				# Modern, flexible logging tool | https://github.com/fpillet/NSLogger
cask 'nsregextester'			# Regex tester | https://github.com/aaronvegh/nsregextester
cask 'markdownmdimporter'	# Markdown Spotlight Plugin | https://brettterpstra.com/2011/10/18/fixing-spotlight-indexing-of-markdown-content/

#############################################################
# Desktop Applications                                      #
#############################################################

# Creativity
cask 'figma' 
cask 'figmadaemon' 
cask 'netdownloadhelpercoapp' 	# Allows video downloads from the Web | https://www.downloadhelper.net/install-coapp
cask 'yousician'					# Musical instrument learning tool | https://yousician.com/

# Media
cask 'spotify', args: { require_sha: false } 	# Propietary music streaming
cask 'plexamp'									# Music player focusing on visuals | https://plexamp.com/
cask 'plex-media-player' 						# Home media player | https://www.plex.tv/
cask 'plex'										# Home media player | https://www.plex.tv/
brew 'pandoc'       							# Universal file converter
cask 'youtube-downloader' # Simple menu bar app to download YouTube movies | https://github.com/DenBeke/YouTube-Downloader-for-macOS
cask 'youtube-to-mp3'		# Downloads music from playlists or channels | https://www.mediahuman.net/youtube-to-mp3/
cask 'ytmdesktop-youtube-music'					# YouTube music client | https://github.com/ytmdesktop/ytmdesktop

# Personal Applications
cask 'mountain-duck'  				# Mount remote storage locations
cask 'audiobook-builder' 			# Turn audio CDs and files into audiobooks
cask 'avg-antivirus'				# Antivirus software
cask 'balenaetcher'					# Tool to flash OS images to SD cards & USB drives
cask 'google-drive'					# 
cask 'torguard'						# VPN client | https://torguard.net/
cask 'openvpn-connect'				# Client program for the OpenVPN Access Server | https://openvpn.net/client-connect-vpn-for-mac-os/

## Personal Applications > Crypto related
cask 'ledger-live'    				# Crypto hardware wallet manager
cask 'trezor-suite'					# Companion app for the Trezor hardware wallet | https://suite.trezor.io/
cask 'trezor-bridge'				# Facilitates communication between the Trezor device and supported browsers | https://wallet.trezor.io/
cask 'authy' 						# Two-factor authentication software

#############################################################
# Productivuty Applications                                 #
#############################################################
# Productivity Apps
cask 'vym' 							# Generate and manipulate maps which show your thoughts | https://sourceforge.net/projects/vym/
cask 'bettertouchtool'				# Tool to customize input devices and automate computer systems
cask 'vitamin-r'					# Collection of productivity tools and techniques | https://www.publicspace.net/Vitamin-R/
cask 'tomatobar'					# Menu bar pomodoro timer | https://github.com/ivoronin/TomatoBar
cask 'todoist'						# To-do list | https://todoist.com/home
#cask 'taskwarrior-pomodoro'		# Taskwarrior-Pomodoro | https://github.com/coddingtonbear/taskwarrior-pomodoro | $iForeked
cask 'rescuetime'					# Time optimising application | https://www.rescuetime.com/
# cask reminders-menubar			# Simple menu bar app to view and interact with reminders | https://github.com/DamascenoRafael/reminders-menubar
cask 'raycast'						# Control your tools with a few keystrokes | https://raycast.com/

# CLI Productivity Apps
brew 'aspell'       	# Spell check
brew 'buku'         	# Bookmark manager
brew 'cmus'         	# Music player
brew 'cointop'      	# Crypto prices and portfolio
brew 'ddgr'         	# Web search, via DuckDuckGo
brew 'khal'         	# Calendar client
brew 'mutt'         	# Email client
brew 'newsboat'     	# RSS / ATOM reader
brew 'pass'         	# Password store
brew 'rclone'       	# Manage cloud storage
brew 'task'         	# Todo + task management
brew 'tasksh'			# Shell wrapper for Taskwarrior commands | https://gothenburgbitfactory.org/projects/tasksh.html
brew 'taskwarrior-tui'	# Terminal user interface for taskwarrior | https://github.com/kdheepak/taskwarrior-tui
cask 'mtmr'				# TouchBar customization app | 	https://github.com/Toxblh/MTMR
cask 'monofocus'			# Keep all tasks from your todo apps on your menu bar | https://monofocus.app/

# System 
cask 'taskexplorer'					# Tool to explore all the running tasks (processes) | https://objective-see.com/products/taskexplorer.html
cask 'memory-cleaner'				# Free up RAM manually and automatically | https://nektony.com/memory-cleaner
cask 'macfuse'						# File system integration | https://osxfuse.github.io/

# Browsers
cask 'firefox'
cask 'chromium'
cask 'orion'
cask 'brave-browser'
cask 'duckduckgo'
cask 'google-chrome'
cask 'webtorrent' 

# SEO 
#cask 'screaming-frog-seo-spider'

# Coomunication 
cask 'slack'			# Team communication and collaboration software | https://slack.com/

# Optionals 
cask 'taskpaper' 					# App to make lists and help with organization | https://www.taskpaper.com/
cask 'standard-notes' 				# Encrypted synced notes

# Just for fun 
cask 'windows95' 						# Electron Windows 95 | https://github.com/felixrieseberg/windows95

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'

# Mac OS Quick-Look Plugins
cask 'qlcolorcode'    # QL for code with highlighting
cask 'qlimagesize'    # QL for size info for images
cask 'qlmarkdown'     # QL for markdown files
cask 'qlprettypatch'  # QL for patch / diff files
cask 'qlstephen'      # QL for dev text files
cask 'qlvideo'        # QL for video formats
cask 'quicklook-csv'  # QL for tables in CSV format
cask 'quicklook-json', args: { require_sha: false } # QL for JSON, with trees
cask 'quicklookapk',   args: { require_sha: false } # QL for Android APKs
cask 'webpquicklook',  args: { require_sha: false } # QL for WebP image files

# Mac OS Mods and Imrovments
cask 'alt-tab'        # Much better alt-tab window switcher
cask 'anybar'         # Custom programmatic menubar icons
cask 'copyq'          # Clipboard manager (cross platform)
cask 'espanso'        # Live text expander (cross-platform)
cask 'finicky'        # Website-specific default browser
cask 'hiddenbar'      # Hide / show annoying menubar icons
brew 'iproute2mac'    # MacOS port of netstat and ifconfig
brew 'lporg'          # Backup and restore launchpad layout
brew 'm-cli'          # All in one MacOS management CLI app
cask 'openinterminal' # Finder button, opens directory in terminal
cask 'popclip'        # Popup options for text on highlight
cask 'raycast', args: { require_sha: false }  # Spotlight alternative
cask 'santa'          # Binary authorization for security
cask 'shottr'         # Better screenshot utility
brew 'skhd'           # Hotkey daemon for macOS
cask 'stats'          # System resource usage in menubar
brew 'yabai'          # Tiling window manager

# Mac OS Utility Apps
cask 'coteditor'      		# Just a simple plain-text editor
cask 'little-snitch'  		# Firewall app viewing / blocking traffic
cask 'keka'           		# File archiver and extractor
cask 'disk-inventory-x' 	# Disk usage utility
cask 'find-empty-folders'	# Finds empty folders
cask 'findergo'				# Open terminal quickly from Finder | https://github.com/onmyway133/FinderGo
cask 'gdisk' 				# Disk partitioning tool | https://sourceforge.net/projects/gptfdisk/
cask 'uninstallpkg'			# PKG software package uninstall tool | https://www.corecode.io/uninstallpkg/
cask 'battery-buddy'		# Replacement of the default battery indicator in the menu bar

#############################################################
# Network and Security Stuff (MR)                           #
#############################################################

# Network and Security Testing
brew 'bettercap'      # Network, scanning and monitoring
brew 'nmap'           # Port scanning
brew 'wrk'            # HTTP benchmarking
cask 'burp-suite'     # Web security testing
cask 'owasp-zap'      # Web app security scanner
cask 'wireshark'      # Network analyzer + packet capture

# Security Utilities and Data Encryption
brew 'bcrypt'        			# Encryption utility, using blowfish
brew 'borgbackup'    			# Encrypted, deduplicated backups
brew 'clamav'        			# Open source virus scanning suite
brew 'dnscrypt-proxy'			# Proxy for using encrypted DNS
cask 'gpg-suite'     			# PGP encryption for emails and files
brew 'git-crypt'     			# Transparent encryption for git repos
brew 'lynis'         			# Scan system for common security issues
brew 'openssl'       			# Cryptography and SSL/TLS Toolkit
brew 'rkhunter'      			# Search / detect potential root kits
cask 'veracrypt'     			# File and volume encryption
cask 'tor-browser'				# Web browser focusing on security | https://www.torproject.org/
cask 'protonmail-bridge' 		# Decrypt ProtonMail emails
cask 'protonvpn'      			# Client app for ProtonVPN

# Security & Pen Testing 
cask 'creepy' # Geolocation OSINT tool

# EOF